In [1]:
import pandas as pd

df = pd.read_csv('top_movies_cleaned.csv') # read csv file

Create a DataFrame for the table in SQL with the cast id, name and gender:

In [2]:
df_act = pd.read_csv('API_cast_gender.csv') # read csv file
df_dir = pd.read_csv('API_dir_gender.csv') # read csv file

In [3]:
df_act['person_gender'] = df_act['person_gender'].replace({'Hombre': 'M', 'Mujer': 'F'})

In [4]:
df_act.rename(columns={'person_id': 'actor_id', 'person_name': 'actor_name', 'person_gender': 'actor_gender'}, inplace=True)

In [5]:
df_act.sample(10)

      actor_id        actor_name actor_gender
309        310    Benjamin Bratt            M
2009      2010      Logan Lerman            M
180        181   Anjelica Huston            F
1724      1725  Juliette Binoche            F
752        753        David Fane            M
3034      3035  Sverrir Gudnason            M
2550      2551   Peter Facinelli            M
1333      1334      Jacob Elordi            M
827        828      Dieter Laser            M
1498      1499   Jessica McNamee            F

In [6]:
df_act.to_csv('actors.csv', index=False)

Create a DataFrame for the table in SQL with the director id, name and gender:

In [7]:
df_dir['person_gender'] = df_dir['person_gender'].replace({'Hombre': 'M', 'Mujer': 'F'})

In [8]:
df_dir.rename(columns={'person_id': 'director_id', 'person_name': 'director_name', 'person_gender': 'director_gender'}, inplace=True)

In [49]:
df_dir.sample(5)

     director_id       director_name director_gender
195          196       David L. Hunt               M
121          122  Cary Joji Fukunaga               M
896          897          Wayne Wang               M
774          775          Scott Beck               M
383          384      Jerome Robbins               M

In [53]:
df_dir['director_gender'].replace('Lasse Hallstr√∂m', 'M', inplace=True)

In [55]:
df_dir['director_gender'].replace('nan', 'N', inplace = True)

In [10]:
df_dir.to_csv('directors.csv', index=False)

Create he dataframe to the genres table, with the id and genre name:

In [11]:
import ast
df['genre'] = df['genre'].apply(lambda x: ast.literal_eval(x) if isinstance(x, str) else x)

In [12]:
all_genres = [genre for sublist in df['genre'] for genre in sublist]

unique_genres = pd.unique(all_genres)

genres_df = pd.DataFrame(unique_genres, columns=['genre_name'])

C:\Users\almuo\AppData\Local\Temp\ipykernel_13612\3372808026.py:3: FutureWarning: unique with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  unique_genres = pd.unique(all_genres)

In [13]:
genres_df['genre_id'] = genres_df.index + 1

In [14]:
genres_df.head(10)

  genre_name  genre_id
0      Drama         1
1    Mystery         2
2   Thriller         3
3  Adventure         4
4     Comedy         5
5     Family         6
6    Romance         7
7      Crime         8
8    History         9
9     Action        10

In [15]:
genres_df.to_csv('genres.csv', index=False)

Create the dataframe for 'movies'table with all the basic information with 'movie_id', 'title', 'rating', 'meta_score', 'year', 'revenue', 'director_id'

In [16]:
# Make a copy of the dataframe to avoid modifying the original data
movies_df = df[['title', 'rating', 'meta_score', 'year', 'revenue', 'director']].copy()

In [17]:
#Add the movie_id column
movies_df['movie_id'] = movies_df.index + 1

In [18]:
# Translate the director's name to director_id
movies_df = movies_df.merge(df_dir[['director_id', 'director_name']], left_on='director', right_on='director_name', how='left')

In [19]:
#Select only the columns we need
movies_df = movies_df[['movie_id', 'title', 'rating', 'meta_score', 'year', 'revenue', 'director_id']]

In [20]:
movies_df.sample(10)

,movie_id,title,rating,meta_score,year,revenue,director_id
854,855,fantastic mr. fox,7.9,83.0,2009,46471023,898
1431,1432,con air,6.9,52.0,1997,224012234,803
1499,1500,the adjustment bureau,7.0,60.0,2011,127869379,287
430,431,the greatest showman,7.5,48.0,2017,432844677,582
1312,1313,captain fantastic,7.8,72.0,2016,23123592,557
1568,1569,war dogs,7.1,57.0,2016,86234523,865
1597,1598,the wedding singer,6.9,59.0,1998,123306987,259
403,404,unfaithful,6.7,63.0,2002,119137784,12
1553,1554,grown ups 2,5.4,19.0,2013,247022278,216
849,850,thor ragnarok,7.9,74.0,2017,855301806,834

In [21]:
movies_df.to_csv('movies.csv', index=False)

Create dataframe for cast table with 'movie_id' and 'person_id':

In [22]:
df['cast'] = df['cast'].apply(lambda x: ast.literal_eval(x) if isinstance(x, str) else x)

In [23]:
cast_df = df.merge(movies_df[['movie_id', 'title']], how='left', left_on='title', right_on='title')

In [24]:
cast_df = cast_df[['movie_id', 'cast']].explode('cast').rename(columns={'cast': 'actor_name'})

In [25]:
cast_df = cast_df.merge(df_act, how='left', left_on='actor_name', right_on='actor_name')

In [26]:
cast_df = cast_df[['movie_id', 'actor_id']]

In [27]:
cast_df.head(10)

   movie_id  actor_id
0         1      1707
1         1      2081
2         1      1004
3         1      2355
4         2      3120
5         2      1180
6         2      2354
7         2      2520
8         3       972
9         3      2135

In [28]:
cast_df.to_csv('cast.csv', index=False)

In [59]:
cast_df = cast_df.drop_duplicates(subset=['movie_id', 'actor_id'])

Create a dataframe wich relates movies_id and genres_id

In [30]:
df['genre'] = df['genre'].apply(lambda x: ast.literal_eval(x) if isinstance(x, str) else x)

movies_genres_df = df.merge(movies_df[['movie_id', 'title']], how='left', left_on='title', right_on='title')

movies_genres_df = movies_genres_df[['movie_id', 'genre']].explode('genre').rename(columns={'genre': 'genre_name'})

movies_genres_df = movies_genres_df.merge(genres_df, how='left', left_on='genre_name', right_on='genre_name')

movies_genres_df = movies_genres_df[['movie_id', 'genre_id']]

In [31]:
movies_genres_df.head(10)

   movie_id  genre_id
0         1         1
1         1         2
2         1         3
3         2         4
4         2         5
5         2         6
6         3         5
7         3         1
8         3         7
9         4         8

In [60]:
movies_genres_df = movies_genres_df.drop_duplicates(subset=['movie_id', 'genre_id'])

In [33]:
movies_genres_df.to_csv('movies_genres.csv', index=False)

# TO SQL

In [34]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql

In [35]:
# Tus par√°metros de conexi√≥n
bd = "top_movies"
password = "Fghijk9798sql*" 
connection_string = f'mysql+pymysql://root:{password}@localhost/{bd}'
engine = create_engine(connection_string)

In [61]:
dataframes = {
    "actors": df_act,
    "directors": df_dir,
    "genres": genres_df,
    "movies": movies_df,
    "cast": cast_df,
    "movies_genres": movies_genres_df
}

In [62]:
# Sent each DataFrame to the database
for table_name, df in dataframes.items():
    df.to_sql(table_name, con=engine, if_exists='append', index=False)
    print(f"Datos insertados en la tabla {table_name}")

Datos insertados en la tabla cast
Datos insertados en la tabla movies_genres